{"a1a2": 0, "a1a3": 1, "a1a4": 2, "a1a5": 3, "a1a6": 4, "a1a7": 5, "a1a8": 6, "a1b1": 7, "a1b2": 8, "a1b3": 9, "a1c1": 10, "a1c2": 11, "a1c3": 12, "a1d1": 13, "a1d4": 14, "a1e1": 15, "a1e5": 16, "a1f1": 17, "a1f6": 18, "a1g1": 19, "a1g7": 20, "a1h1": 21, "a1h8": 22, "a2a1": 23, "a2a1b": 24, "a2a1n": 25, "a2a1q": 26, "a2a1r": 27, "a2a3": 28, "a2a4": 29, "a2a5": 30, "a2a6": 31, "a2a7": 32, "a2a8": 33, "a2b1": 34, "a2b1q": 35, "a2b2": 36, "a2b3": 37, "a2b4": 38, "a2c1": 39, "a2c2": 40, "a2c3": 41, "a2c4": 42, "a2d2": 43, "a2d5": 44, "a2e2": 45, "a2e6": 46, "a2f2": 47, "a2f7": 48, "a2g2": 49, "a2g8": 50, "a2h2": 51, "a3a1": 52, "a3a2": 53, "a3a4": 54, "a3a5": 55, "a3a6": 56, "a3a7": 57, "a3a8": 58, "a3b1": 59, "a3b2": 60, "a3b3": 61, "a3b4": 62, "a3b5": 63, "a3c1": 64, "a3c2": 65, "a3c3": 66, "a3c4": 67, "a3c5": 68, "a3d3": 69, "a3d6": 70, "a3e3": 71, "a3e7": 72, "a3f3": 73, "a3f8": 74, "a3g3": 75, "a3h3": 76, "a4a1": 77, "a4a2": 78, "a4a3": 79, "a4a5": 80, "a4a6": 81, "a4a7": 82, "a4a8": 83, "a4b2": 84, "a4b3": 85, "a4b4": 86, "a4b5": 87, "a4b6": 88, "a4c2": 89, "a4c3": 90, "a4c4": 91, "a4c5": 92, "a4c6": 93, "a4d1": 94, "a4d4": 95, "a4d7": 96, "a4e4": 97, "a4e8": 98, "a4f4": 99, "a4g4": 100, "a4h4": 101, "a5a1": 102, "a5a2": 103, "a5a3": 104, "a5a4": 105, "a5a6": 106, "a5a7": 107, "a5a8": 108, "a5b3": 109, "a5b4": 110, "a5b5": 111, "a5b6": 112, "a5b7": 113, "a5c3": 114, "a5c4": 115, "a5c5": 116, "a5c6": 117, "a5c7": 118, "a5d2": 119, "a5d5": 120, "a5d8": 121, "a5e1": 122, "a5e5": 123, "a5f5": 124, "a5g5": 125, "a5h5": 126, "a6a1": 127, "a6a2": 128, "a6a3": 129, "a6a4": 130, "a6a5": 131, "a6a7": 132, "a6a8": 133, "a6b4": 134, "a6b5": 135, "a6b6": 136, "a6b7": 137, "a6b8": 138, "a6c4": 139, "a6c5": 140, "a6c6": 141, "a6c7": 142, "a6c8": 143, "a6d3": 144, "a6d6": 145, "a6e2": 146, "a6e6": 147, "a6f1": 148, "a6f6": 149, "a6g6": 150, "a6h6": 151, "a7a1": 152, "a7a2": 153, "a7a3": 154, "a7a4": 155, "a7a5": 156, "a7a6": 157, "a7a8": 158, "a7a8b": 159, "a7a8q": 160, "a7a8r": 161, "a7b5": 162, "a7b6": 163, "a7b7": 164, "a7b8": 165, "a7b8q": 166, "a7c5": 167, "a7c6": 168, "a7c7": 169, "a7c8": 170, "a7d4": 171, "a7d7": 172, "a7e3": 173, "a7e7": 174, "a7f2": 175, "a7f7": 176, "a7g1": 177, "a7g7": 178, "a7h7": 179, "a8a1": 180, "a8a2": 181, "a8a3": 182, "a8a4": 183, "a8a5": 184, "a8a6": 185, "a8a7": 186, "a8b6": 187, "a8b7": 188, "a8b8": 189, "a8c6": 190, "a8c7": 191, "a8c8": 192, "a8d5": 193, "a8d8": 194, "a8e4": 195, "a8e8": 196, "a8f3": 197, "a8f8": 198, "a8g2": 199, "a8g8": 200, "a8h1": 201, "a8h8": 202, "b1a1": 203, "b1a2": 204, "b1a3": 205, "b1b2": 206, "b1b3": 207, "b1b4": 208, "b1b5": 209, "b1b6": 210, "b1b7": 211, "b1b8": 212, "b1c1": 213, "b1c2": 214, "b1c3": 215, "b1d1": 216, "b1d2": 217, "b1d3": 218, "b1e1": 219, "b1e4": 220, "b1f1": 221, "b1f5": 222, "b1g1": 223, "b1g6": 224, "b1h1": 225, "b1h7": 226, "b2a1": 227, "b2a1q": 228, "b2a2": 229, "b2a3": 230, "b2a4": 231, "b2b1": 232, "b2b1q": 233, "b2b1r": 234, "b2b3": 235, "b2b4": 236, "b2b5": 237, "b2b6": 238, "b2b7": 239, "b2b8": 240, "b2c1": 241, "b2c1q": 242, "b2c2": 243, "b2c3": 244, "b2c4": 245, "b2d1": 246, "b2d2": 247, "b2d3": 248, "b2d4": 249, "b2e2": 250, "b2e5": 251, "b2f2": 252, "b2f6": 253, "b2g2": 254, "b2g7": 255, "b2h2": 256, "b2h8": 257, "b3a1": 258, "b3a2": 259, "b3a3": 260, "b3a4": 261, "b3a5": 262, "b3b1": 263, "b3b2": 264, "b3b4": 265, "b3b5": 266, "b3b6": 267, "b3b7": 268, "b3b8": 269, "b3c1": 270, "b3c2": 271, "b3c3": 272, "b3c4": 273, "b3c5": 274, "b3d1": 275, "b3d2": 276, "b3d3": 277, "b3d4": 278, "b3d5": 279, "b3e3": 280, "b3e6": 281, "b3f3": 282, "b3f7": 283, "b3g3": 284, "b3g8": 285, "b3h3": 286, "b4a2": 287, "b4a3": 288, "b4a4": 289, "b4a5": 290, "b4a6": 291, "b4b1": 292, "b4b2": 293, "b4b3": 294, "b4b5": 295, "b4b6": 296, "b4b7": 297, "b4b8": 298, "b4c2": 299, "b4c3": 300, "b4c4": 301, "b4c5": 302, "b4c6": 303, "b4d2": 304, "b4d3": 305, "b4d4": 306, "b4d5": 307, "b4d6": 308, "b4e1": 309, "b4e4": 310, "b4e7": 311, "b4f4": 312, "b4f8": 313, "b4g4": 314, "b4h4": 315, "b5a3": 316, "b5a4": 317, "b5a5": 318, "b5a6": 319, "b5a7": 320, "b5b1": 321, "b5b2": 322, "b5b3": 323, "b5b4": 324, "b5b6": 325, "b5b7": 326, "b5b8": 327, "b5c3": 328, "b5c4": 329, "b5c5": 330, "b5c6": 331, "b5c7": 332, "b5d3": 333, "b5d4": 334, "b5d5": 335, "b5d6": 336, "b5d7": 337, "b5e2": 338, "b5e5": 339, "b5e8": 340, "b5f1": 341, "b5f5": 342, "b5g5": 343, "b5h5": 344, "b6a4": 345, "b6a5": 346, "b6a6": 347, "b6a7": 348, "b6a8": 349, "b6b1": 350, "b6b2": 351, "b6b3": 352, "b6b4": 353, "b6b5": 354, "b6b7": 355, "b6b8": 356, "b6c4": 357, "b6c5": 358, "b6c6": 359, "b6c7": 360, "b6c8": 361, "b6d4": 362, "b6d5": 363, "b6d6": 364, "b6d7": 365, "b6d8": 366, "b6e3": 367, "b6e6": 368, "b6f2": 369, "b6f6": 370, "b6g1": 371, "b6g6": 372, "b6h6": 373, "b7a5": 374, "b7a6": 375, "b7a7": 376, "b7a8": 377, "b7a8q": 378, "b7a8r": 379, "b7b1": 380, "b7b2": 381, "b7b3": 382, "b7b4": 383, "b7b5": 384, "b7b6": 385, "b7b8": 386, "b7b8b": 387, "b7b8n": 388, "b7b8q": 389, "b7b8r": 390, "b7c5": 391, "b7c6": 392, "b7c7": 393, "b7c8": 394, "b7c8q": 395, "b7d5": 396, "b7d6": 397, "b7d7": 398, "b7d8": 399, "b7e4": 400, "b7e7": 401, "b7f3": 402, "b7f7": 403, "b7g2": 404, "b7g7": 405, "b7h1": 406, "b7h7": 407, "b8a6": 408, "b8a7": 409, "b8a8": 410, "b8b1": 411, "b8b2": 412, "b8b3": 413, "b8b4": 414, "b8b5": 415, "b8b6": 416, "b8b7": 417, "b8c6": 418, "b8c7": 419, "b8c8": 420, "b8d6": 421, "b8d7": 422, "b8d8": 423, "b8e5": 424, "b8e8": 425, "b8f4": 426, "b8f8": 427, "b8g3": 428, "b8g8": 429, "b8h2": 430, "b8h8": 431, "c1a1": 432, "c1a2": 433, "c1a3": 434, "c1b1": 435, "c1b2": 436, "c1b3": 437, "c1c2": 438, "c1c3": 439, "c1c4": 440, "c1c5": 441, "c1c6": 442, "c1c7": 443, "c1c8": 444, "c1d1": 445, "c1d2": 446, "c1d3": 447, "c1e1": 448, "c1e2": 449, "c1e3": 450, "c1f1": 451, "c1f4": 452, "c1g1": 453, "c1g5": 454, "c1h1": 455, "c1h6": 456, "c2a1": 457, "c2a2": 458, "c2a3": 459, "c2a4": 460, "c2b1": 461, "c2b1q": 462, "c2b2": 463, "c2b3": 464, "c2b4": 465, "c2c1": 466, "c2c1n": 467, "c2c1q": 468, "c2c1r": 469, "c2c3": 470, "c2c4": 471, "c2c5": 472, "c2c6": 473, "c2c7": 474, "c2c8": 475, "c2d1": 476, "c2d1q": 477, "c2d2": 478, "c2d3": 479, "c2d4": 480, "c2e1": 481, "c2e2": 482, "c2e3": 483, "c2e4": 484, "c2f2": 485, "c2f5": 486, "c2g2": 487, "c2g6": 488, "c2h2": 489, "c2h7": 490, "c3a1": 491, "c3a2": 492, "c3a3": 493, "c3a4": 494, "c3a5": 495, "c3b1": 496, "c3b2": 497, "c3b3": 498, "c3b4": 499, "c3b5": 500, "c3c1": 501, "c3c2": 502, "c3c4": 503, "c3c5": 504, "c3c6": 505, "c3c7": 506, "c3c8": 507, "c3d1": 508, "c3d2": 509, "c3d3": 510, "c3d4": 511, "c3d5": 512, "c3e1": 513, "c3e2": 514, "c3e3": 515, "c3e4": 516, "c3e5": 517, "c3f3": 518, "c3f6": 519, "c3g3": 520, "c3g7": 521, "c3h3": 522, "c3h8": 523, "c4a2": 524, "c4a3": 525, "c4a4": 526, "c4a5": 527, "c4a6": 528, "c4b2": 529, "c4b3": 530, "c4b4": 531, "c4b5": 532, "c4b6": 533, "c4c1": 534, "c4c2": 535, "c4c3": 536, "c4c5": 537, "c4c6": 538, "c4c7": 539, "c4c8": 540, "c4d2": 541, "c4d3": 542, "c4d4": 543, "c4d5": 544, "c4d6": 545, "c4e2": 546, "c4e3": 547, "c4e4": 548, "c4e5": 549, "c4e6": 550, "c4f1": 551, "c4f4": 552, "c4f7": 553, "c4g4": 554, "c4g8": 555, "c4h4": 556, "c5a3": 557, "c5a4": 558, "c5a5": 559, "c5a6": 560, "c5a7": 561, "c5b3": 562, "c5b4": 563, "c5b5": 564, "c5b6": 565, "c5b7": 566, "c5c1": 567, "c5c2": 568, "c5c3": 569, "c5c4": 570, "c5c6": 571, "c5c7": 572, "c5c8": 573, "c5d3": 574, "c5d4": 575, "c5d5": 576, "c5d6": 577, "c5d7": 578, "c5e3": 579, "c5e4": 580, "c5e5": 581, "c5e6": 582, "c5e7": 583, "c5f2": 584, "c5f5": 585, "c5f8": 586, "c5g1": 587, "c5g5": 588, "c5h5": 589, "c6a4": 590, "c6a5": 591, "c6a6": 592, "c6a7": 593, "c6a8": 594, "c6b4": 595, "c6b5": 596, "c6b6": 597, "c6b7": 598, "c6b8": 599, "c6c1": 600, "c6c2": 601, "c6c3": 602, "c6c4": 603, "c6c5": 604, "c6c7": 605, "c6c8": 606, "c6d4": 607, "c6d5": 608, "c6d6": 609, "c6d7": 610, "c6d8": 611, "c6e4": 612, "c6e5": 613, "c6e6": 614, "c6e7": 615, "c6e8": 616, "c6f3": 617, "c6f6": 618, "c6g2": 619, "c6g6": 620, "c6h1": 621, "c6h6": 622, "c7a5": 623, "c7a6": 624, "c7a7": 625, "c7a8": 626, "c7b5": 627, "c7b6": 628, "c7b7": 629, "c7b8": 630, "c7b8q": 631, "c7c1": 632, "c7c2": 633, "c7c3": 634, "c7c4": 635, "c7c5": 636, "c7c6": 637, "c7c8": 638, "c7c8q": 639, "c7c8r": 640, "c7d5": 641, "c7d6": 642, "c7d7": 643, "c7d8": 644, "c7d8q": 645, "c7e5": 646, "c7e6": 647, "c7e7": 648, "c7e8": 649, "c7f4": 650, "c7f7": 651, "c7g3": 652, "c7g7": 653, "c7h2": 654, "c7h7": 655, "c8a6": 656, "c8a7": 657, "c8a8": 658, "c8b6": 659, "c8b7": 660, "c8b8": 661, "c8c1": 662, "c8c2": 663, "c8c3": 664, "c8c4": 665, "c8c5": 666, "c8c6": 667, "c8c7": 668, "c8d6": 669, "c8d7": 670, "c8d8": 671, "c8e6": 672, "c8e7": 673, "c8e8": 674, "c8f5": 675, "c8f8": 676, "c8g4": 677, "c8g8": 678, "c8h3": 679, "c8h8": 680, "d1a1": 681, "d1a4": 682, "d1b1": 683, "d1b2": 684, "d1b3": 685, "d1c1": 686, "d1c2": 687, "d1c3": 688, "d1d2": 689, "d1d3": 690, "d1d4": 691, "d1d5": 692, "d1d6": 693, "d1d7": 694, "d1d8": 695, "d1e1": 696, "d1e2": 697, "d1e3": 698, "d1f1": 699, "d1f2": 700, "d1f3": 701, "d1g1": 702, "d1g4": 703, "d1h1": 704, "d1h5": 705, "d2a2": 706, "d2a5": 707, "d2b1": 708, "d2b2": 709, "d2b3": 710, "d2b4": 711, "d2c1": 712, "d2c1q": 713, "d2c2": 714, "d2c3": 715, "d2c4": 716, "d2d1": 717, "d2d1n": 718, "d2d1q": 719, "d2d1r": 720, "d2d3": 721, "d2d4": 722, "d2d5": 723, "d2d6": 724, "d2d7": 725, "d2d8": 726, "d2e1": 727, "d2e1q": 728, "d2e2": 729, "d2e3": 730, "d2e4": 731, "d2f1": 732, "d2f2": 733, "d2f3": 734, "d2f4": 735, "d2g2": 736, "d2g5": 737, "d2h2": 738, "d2h6": 739, "d3a3": 740, "d3a6": 741, "d3b1": 742, "d3b2": 743, "d3b3": 744, "d3b4": 745, "d3b5": 746, "d3c1": 747, "d3c2": 748, "d3c3": 749, "d3c4": 750, "d3c5": 751, "d3d1": 752, "d3d2": 753, "d3d4": 754, "d3d5": 755, "d3d6": 756, "d3d7": 757, "d3d8": 758, "d3e1": 759, "d3e2": 760, "d3e3": 761, "d3e4": 762, "d3e5": 763, "d3f1": 764, "d3f2": 765, "d3f3": 766, "d3f4": 767, "d3f5": 768, "d3g3": 769, "d3g6": 770, "d3h3": 771, "d3h7": 772, "d4a1": 773, "d4a4": 774, "d4a7": 775, "d4b2": 776, "d4b3": 777, "d4b4": 778, "d4b5": 779, "d4b6": 780, "d4c2": 781, "d4c3": 782, "d4c4": 783, "d4c5": 784, "d4c6": 785, "d4d1": 786, "d4d2": 787, "d4d3": 788, "d4d5": 789, "d4d6": 790, "d4d7": 791, "d4d8": 792, "d4e2": 793, "d4e3": 794, "d4e4": 795, "d4e5": 796, "d4e6": 797, "d4f2": 798, "d4f3": 799, "d4f4": 800, "d4f5": 801, "d4f6": 802, "d4g1": 803, "d4g4": 804, "d4g7": 805, "d4h4": 806, "d4h8": 807, "d5a2": 808, "d5a5": 809, "d5a8": 810, "d5b3": 811, "d5b4": 812, "d5b5": 813, "d5b6": 814, "d5b7": 815, "d5c3": 816, "d5c4": 817, "d5c5": 818, "d5c6": 819, "d5c7": 820, "d5d1": 821, "d5d2": 822, "d5d3": 823, "d5d4": 824, "d5d6": 825, "d5d7": 826, "d5d8": 827, "d5e3": 828, "d5e4": 829, "d5e5": 830, "d5e6": 831, "d5e7": 832, "d5f3": 833, "d5f4": 834, "d5f5": 835, "d5f6": 836, "d5f7": 837, "d5g2": 838, "d5g5": 839, "d5g8": 840, "d5h1": 841, "d5h5": 842, "d6a3": 843, "d6a6": 844, "d6b4": 845, "d6b5": 846, "d6b6": 847, "d6b7": 848, "d6b8": 849, "d6c4": 850, "d6c5": 851, "d6c6": 852, "d6c7": 853, "d6c8": 854, "d6d1": 855, "d6d2": 856, "d6d3": 857, "d6d4": 858, "d6d5": 859, "d6d7": 860, "d6d8": 861, "d6e4": 862, "d6e5": 863, "d6e6": 864, "d6e7": 865, "d6e8": 866, "d6f4": 867, "d6f5": 868, "d6f6": 869, "d6f7": 870, "d6f8": 871, "d6g3": 872, "d6g6": 873, "d6h2": 874, "d6h6": 875, "d7a4": 876, "d7a7": 877, "d7b5": 878, "d7b6": 879, "d7b7": 880, "d7b8": 881, "d7c5": 882, "d7c6": 883, "d7c7": 884, "d7c8": 885, "d7c8q": 886, "d7c8r": 887, "d7d1": 888, "d7d2": 889, "d7d3": 890, "d7d4": 891, "d7d5": 892, "d7d6": 893, "d7d8": 894, "d7d8b": 895, "d7d8n": 896, "d7d8q": 897, "d7d8r": 898, "d7e5": 899, "d7e6": 900, "d7e7": 901, "d7e8": 902, "d7e8q": 903, "d7f5": 904, "d7f6": 905, "d7f7": 906, "d7f8": 907, "d7g4": 908, "d7g7": 909, "d7h3": 910, "d7h7": 911, "d8a5": 912, "d8a8": 913, "d8b6": 914, "d8b7": 915, "d8b8": 916, "d8c6": 917, "d8c7": 918, "d8c8": 919, "d8d1": 920, "d8d2": 921, "d8d3": 922, "d8d4": 923, "d8d5": 924, "d8d6": 925, "d8d7": 926, "d8e6": 927, "d8e7": 928, "d8e8": 929, "d8f6": 930, "d8f7": 931, "d8f8": 932, "d8g5": 933, "d8g8": 934, "d8h4": 935, "d8h8": 936, "e1a1": 937, "e1a5": 938, "e1b1": 939, "e1b4": 940, "e1c1": 941, "e1c2": 942, "e1c3": 943, "e1d1": 944, "e1d2": 945, "e1d3": 946, "e1e2": 947, "e1e3": 948, "e1e4": 949, "e1e5": 950, "e1e6": 951, "e1e7": 952, "e1e8": 953, "e1f1": 954, "e1f2": 955, "e1f3": 956, "e1g1": 957, "e1g2": 958, "e1g3": 959, "e1h1": 960, "e1h4": 961, "e2a2": 962, "e2a6": 963, "e2b2": 964, "e2b5": 965, "e2c1": 966, "e2c2": 967, "e2c3": 968, "e2c4": 969, "e2d1": 970, "e2d1q": 971, "e2d2": 972, "e2d3": 973, "e2d4": 974, "e2e1": 975, "e2e1n": 976, "e2e1q": 977, "e2e1r": 978, "e2e3": 979, "e2e4": 980, "e2e5": 981, "e2e6": 982, "e2e7": 983, "e2e8": 984, "e2f1": 985, "e2f1q": 986, "e2f2": 987, "e2f3": 988, "e2f4": 989, "e2g1": 990, "e2g2": 991, "e2g3": 992, "e2g4": 993, "e2h2": 994, "e2h5": 995, "e3a3": 996, "e3a7": 997, "e3b3": 998, "e3b6": 999, "e3c1": 1000, "e3c2": 1001, "e3c3": 1002, "e3c4": 1003, "e3c5": 1004, "e3d1": 1005, "e3d2": 1006, "e3d3": 1007, "e3d4": 1008, "e3d5": 1009, "e3e1": 1010, "e3e2": 1011, "e3e4": 1012, "e3e5": 1013, "e3e6": 1014, "e3e7": 1015, "e3e8": 1016, "e3f1": 1017, "e3f2": 1018, "e3f3": 1019, "e3f4": 1020, "e3f5": 1021, "e3g1": 1022, "e3g2": 1023, "e3g3": 1024, "e3g4": 1025, "e3g5": 1026, "e3h3": 1027, "e3h6": 1028, "e4a4": 1029, "e4a8": 1030, "e4b1": 1031, "e4b4": 1032, "e4b7": 1033, "e4c2": 1034, "e4c3": 1035, "e4c4": 1036, "e4c5": 1037, "e4c6": 1038, "e4d2": 1039, "e4d3": 1040, "e4d4": 1041, "e4d5": 1042, "e4d6": 1043, "e4e1": 1044, "e4e2": 1045, "e4e3": 1046, "e4e5": 1047, "e4e6": 1048, "e4e7": 1049, "e4e8": 1050, "e4f2": 1051, "e4f3": 1052, "e4f4": 1053, "e4f5": 1054, "e4f6": 1055, "e4g2": 1056, "e4g3": 1057, "e4g4": 1058, "e4g5": 1059, "e4g6": 1060, "e4h1": 1061, "e4h4": 1062, "e4h7": 1063, "e5a1": 1064, "e5a5": 1065, "e5b2": 1066, "e5b5": 1067, "e5b8": 1068, "e5c3": 1069, "e5c4": 1070, "e5c5": 1071, "e5c6": 1072, "e5c7": 1073, "e5d3": 1074, "e5d4": 1075, "e5d5": 1076, "e5d6": 1077, "e5d7": 1078, "e5e1": 1079, "e5e2": 1080, "e5e3": 1081, "e5e4": 1082, "e5e6": 1083, "e5e7": 1084, "e5e8": 1085, "e5f3": 1086, "e5f4": 1087, "e5f5": 1088, "e5f6": 1089, "e5f7": 1090, "e5g3": 1091, "e5g4": 1092, "e5g5": 1093, "e5g6": 1094, "e5g7": 1095, "e5h2": 1096, "e5h5": 1097, "e5h8": 1098, "e6a2": 1099, "e6a6": 1100, "e6b3": 1101, "e6b6": 1102, "e6c4": 1103, "e6c5": 1104, "e6c6": 1105, "e6c7": 1106, "e6c8": 1107, "e6d4": 1108, "e6d5": 1109, "e6d6": 1110, "e6d7": 1111, "e6d8": 1112, "e6e1": 1113, "e6e2": 1114, "e6e3": 1115, "e6e4": 1116, "e6e5": 1117, "e6e7": 1118, "e6e8": 1119, "e6f4": 1120, "e6f5": 1121, "e6f6": 1122, "e6f7": 1123, "e6f8": 1124, "e6g4": 1125, "e6g5": 1126, "e6g6": 1127, "e6g7": 1128, "e6g8": 1129, "e6h3": 1130, "e6h6": 1131, "e7a3": 1132, "e7a7": 1133, "e7b4": 1134, "e7b7": 1135, "e7c5": 1136, "e7c6": 1137, "e7c7": 1138, "e7c8": 1139, "e7d5": 1140, "e7d6": 1141, "e7d7": 1142, "e7d8": 1143, "e7d8q": 1144, "e7e1": 1145, "e7e2": 1146, "e7e3": 1147, "e7e4": 1148, "e7e5": 1149, "e7e6": 1150, "e7e8": 1151, "e7e8b": 1152, "e7e8n": 1153, "e7e8q": 1154, "e7e8r": 1155, "e7f5": 1156, "e7f6": 1157, "e7f7": 1158, "e7f8": 1159, "e7f8q": 1160, "e7f8r": 1161, "e7g5": 1162, "e7g6": 1163, "e7g7": 1164, "e7g8": 1165, "e7h4": 1166, "e7h7": 1167, "e8a4": 1168, "e8a8": 1169, "e8b5": 1170, "e8b8": 1171, "e8c6": 1172, "e8c7": 1173, "e8c8": 1174, "e8d6": 1175, "e8d7": 1176, "e8d8": 1177, "e8e1": 1178, "e8e2": 1179, "e8e3": 1180, "e8e4": 1181, "e8e5": 1182, "e8e6": 1183, "e8e7": 1184, "e8f6": 1185, "e8f7": 1186, "e8f8": 1187, "e8g6": 1188, "e8g7": 1189, "e8g8": 1190, "e8h5": 1191, "e8h8": 1192, "f1a1": 1193, "f1a6": 1194, "f1b1": 1195, "f1b5": 1196, "f1c1": 1197, "f1c4": 1198, "f1d1": 1199, "f1d2": 1200, "f1d3": 1201, "f1e1": 1202, "f1e2": 1203, "f1e3": 1204, "f1f2": 1205, "f1f3": 1206, "f1f4": 1207, "f1f5": 1208, "f1f6": 1209, "f1f7": 1210, "f1f8": 1211, "f1g1": 1212, "f1g2": 1213, "f1g3": 1214, "f1h1": 1215, "f1h2": 1216, "f1h3": 1217, "f2a2": 1218, "f2a7": 1219, "f2b2": 1220, "f2b6": 1221, "f2c2": 1222, "f2c5": 1223, "f2d1": 1224, "f2d2": 1225, "f2d3": 1226, "f2d4": 1227, "f2e1": 1228, "f2e1n": 1229, "f2e1q": 1230, "f2e1r": 1231, "f2e2": 1232, "f2e3": 1233, "f2e4": 1234, "f2f1": 1235, "f2f1n": 1236, "f2f1q": 1237, "f2f1r": 1238, "f2f3": 1239, "f2f4": 1240, "f2f5": 1241, "f2f6": 1242, "f2f7": 1243, "f2f8": 1244, "f2g1": 1245, "f2g1q": 1246, "f2g2": 1247, "f2g3": 1248, "f2g4": 1249, "f2h1": 1250, "f2h2": 1251, "f2h3": 1252, "f2h4": 1253, "f3a3": 1254, "f3a8": 1255, "f3b3": 1256, "f3b7": 1257, "f3c3": 1258, "f3c6": 1259, "f3d1": 1260, "f3d2": 1261, "f3d3": 1262, "f3d4": 1263, "f3d5": 1264, "f3e1": 1265, "f3e2": 1266, "f3e3": 1267, "f3e4": 1268, "f3e5": 1269, "f3f1": 1270, "f3f2": 1271, "f3f4": 1272, "f3f5": 1273, "f3f6": 1274, "f3f7": 1275, "f3f8": 1276, "f3g1": 1277, "f3g2": 1278, "f3g3": 1279, "f3g4": 1280, "f3g5": 1281, "f3h1": 1282, "f3h2": 1283, "f3h3": 1284, "f3h4": 1285, "f3h5": 1286, "f4a4": 1287, "f4b4": 1288, "f4b8": 1289, "f4c1": 1290, "f4c4": 1291, "f4c7": 1292, "f4d2": 1293, "f4d3": 1294, "f4d4": 1295, "f4d5": 1296, "f4d6": 1297, "f4e2": 1298, "f4e3": 1299, "f4e4": 1300, "f4e5": 1301, "f4e6": 1302, "f4f1": 1303, "f4f2": 1304, "f4f3": 1305, "f4f5": 1306, "f4f6": 1307, "f4f7": 1308, "f4f8": 1309, "f4g2": 1310, "f4g3": 1311, "f4g4": 1312, "f4g5": 1313, "f4g6": 1314, "f4h2": 1315, "f4h3": 1316, "f4h4": 1317, "f4h5": 1318, "f4h6": 1319, "f5a5": 1320, "f5b1": 1321, "f5b5": 1322, "f5c2": 1323, "f5c5": 1324, "f5c8": 1325, "f5d3": 1326, "f5d4": 1327, "f5d5": 1328, "f5d6": 1329, "f5d7": 1330, "f5e3": 1331, "f5e4": 1332, "f5e5": 1333, "f5e6": 1334, "f5e7": 1335, "f5f1": 1336, "f5f2": 1337, "f5f3": 1338, "f5f4": 1339, "f5f6": 1340, "f5f7": 1341, "f5f8": 1342, "f5g3": 1343, "f5g4": 1344, "f5g5": 1345, "f5g6": 1346, "f5g7": 1347, "f5h3": 1348, "f5h4": 1349, "f5h5": 1350, "f5h6": 1351, "f5h7": 1352, "f6a1": 1353, "f6a6": 1354, "f6b2": 1355, "f6b6": 1356, "f6c3": 1357, "f6c6": 1358, "f6d4": 1359, "f6d5": 1360, "f6d6": 1361, "f6d7": 1362, "f6d8": 1363, "f6e4": 1364, "f6e5": 1365, "f6e6": 1366, "f6e7": 1367, "f6e8": 1368, "f6f1": 1369, "f6f2": 1370, "f6f3": 1371, "f6f4": 1372, "f6f5": 1373, "f6f7": 1374, "f6f8": 1375, "f6g4": 1376, "f6g5": 1377, "f6g6": 1378, "f6g7": 1379, "f6g8": 1380, "f6h4": 1381, "f6h5": 1382, "f6h6": 1383, "f6h7": 1384, "f6h8": 1385, "f7a2": 1386, "f7a7": 1387, "f7b3": 1388, "f7b7": 1389, "f7c4": 1390, "f7c7": 1391, "f7d5": 1392, "f7d6": 1393, "f7d7": 1394, "f7d8": 1395, "f7e5": 1396, "f7e6": 1397, "f7e7": 1398, "f7e8": 1399, "f7e8q": 1400, "f7f1": 1401, "f7f2": 1402, "f7f3": 1403, "f7f4": 1404, "f7f5": 1405, "f7f6": 1406, "f7f8": 1407, "f7f8b": 1408, "f7f8n": 1409, "f7f8q": 1410, "f7f8r": 1411, "f7g5": 1412, "f7g6": 1413, "f7g7": 1414, "f7g8": 1415, "f7g8q": 1416, "f7h5": 1417, "f7h6": 1418, "f7h7": 1419, "f7h8": 1420, "f8a3": 1421, "f8a8": 1422, "f8b4": 1423, "f8b8": 1424, "f8c5": 1425, "f8c8": 1426, "f8d6": 1427, "f8d7": 1428, "f8d8": 1429, "f8e6": 1430, "f8e7": 1431, "f8e8": 1432, "f8f1": 1433, "f8f2": 1434, "f8f3": 1435, "f8f4": 1436, "f8f5": 1437, "f8f6": 1438, "f8f7": 1439, "f8g6": 1440, "f8g7": 1441, "f8g8": 1442, "f8h6": 1443, "f8h7": 1444, "f8h8": 1445, "g1a1": 1446, "g1a7": 1447, "g1b1": 1448, "g1b6": 1449, "g1c1": 1450, "g1c5": 1451, "g1d1": 1452, "g1d4": 1453, "g1e1": 1454, "g1e2": 1455, "g1e3": 1456, "g1f1": 1457, "g1f2": 1458, "g1f3": 1459, "g1g2": 1460, "g1g3": 1461, "g1g4": 1462, "g1g5": 1463, "g1g6": 1464, "g1g7": 1465, "g1g8": 1466, "g1h1": 1467, "g1h2": 1468, "g1h3": 1469, "g2a2": 1470, "g2a8": 1471, "g2b2": 1472, "g2b7": 1473, "g2c2": 1474, "g2c6": 1475, "g2d2": 1476, "g2d5": 1477, "g2e1": 1478, "g2e2": 1479, "g2e3": 1480, "g2e4": 1481, "g2f1": 1482, "g2f1q": 1483, "g2f2": 1484, "g2f3": 1485, "g2f4": 1486, "g2g1": 1487, "g2g1n": 1488, "g2g1q": 1489, "g2g1r": 1490, "g2g3": 1491, "g2g4": 1492, "g2g5": 1493, "g2g6": 1494, "g2g7": 1495, "g2g8": 1496, "g2h1": 1497, "g2h2": 1498, "g2h3": 1499, "g2h4": 1500, "g3a3": 1501, "g3b3": 1502, "g3b8": 1503, "g3c3": 1504, "g3c7": 1505, "g3d3": 1506, "g3d6": 1507, "g3e1": 1508, "g3e2": 1509, "g3e3": 1510, "g3e4": 1511, "g3e5": 1512, "g3f1": 1513, "g3f2": 1514, "g3f3": 1515, "g3f4": 1516, "g3f5": 1517, "g3g1": 1518, "g3g2": 1519, "g3g4": 1520, "g3g5": 1521, "g3g6": 1522, "g3g7": 1523, "g3g8": 1524, "g3h1": 1525, "g3h2": 1526, "g3h3": 1527, "g3h4": 1528, "g3h5": 1529, "g4a4": 1530, "g4b4": 1531, "g4c4": 1532, "g4c8": 1533, "g4d1": 1534, "g4d4": 1535, "g4d7": 1536, "g4e2": 1537, "g4e3": 1538, "g4e4": 1539, "g4e5": 1540, "g4e6": 1541, "g4f2": 1542, "g4f3": 1543, "g4f4": 1544, "g4f5": 1545, "g4f6": 1546, "g4g1": 1547, "g4g2": 1548, "g4g3": 1549, "g4g5": 1550, "g4g6": 1551, "g4g7": 1552, "g4g8": 1553, "g4h2": 1554, "g4h3": 1555, "g4h4": 1556, "g4h5": 1557, "g4h6": 1558, "g5a5": 1559, "g5b5": 1560, "g5c1": 1561, "g5c5": 1562, "g5d2": 1563, "g5d5": 1564, "g5d8": 1565, "g5e3": 1566, "g5e4": 1567, "g5e5": 1568, "g5e6": 1569, "g5e7": 1570, "g5f3": 1571, "g5f4": 1572, "g5f5": 1573, "g5f6": 1574, "g5f7": 1575, "g5g1": 1576, "g5g2": 1577, "g5g3": 1578, "g5g4": 1579, "g5g6": 1580, "g5g7": 1581, "g5g8": 1582, "g5h3": 1583, "g5h4": 1584, "g5h5": 1585, "g5h6": 1586, "g5h7": 1587, "g6a6": 1588, "g6b1": 1589, "g6b6": 1590, "g6c2": 1591, "g6c6": 1592, "g6d3": 1593, "g6d6": 1594, "g6e4": 1595, "g6e5": 1596, "g6e6": 1597, "g6e7": 1598, "g6e8": 1599, "g6f4": 1600, "g6f5": 1601, "g6f6": 1602, "g6f7": 1603, "g6f8": 1604, "g6g1": 1605, "g6g2": 1606, "g6g3": 1607, "g6g4": 1608, "g6g5": 1609, "g6g7": 1610, "g6g8": 1611, "g6h4": 1612, "g6h5": 1613, "g6h6": 1614, "g6h7": 1615, "g6h8": 1616, "g7a1": 1617, "g7a7": 1618, "g7b2": 1619, "g7b7": 1620, "g7c3": 1621, "g7c7": 1622, "g7d4": 1623, "g7d7": 1624, "g7e5": 1625, "g7e6": 1626, "g7e7": 1627, "g7e8": 1628, "g7f5": 1629, "g7f6": 1630, "g7f7": 1631, "g7f8": 1632, "g7f8q": 1633, "g7g1": 1634, "g7g2": 1635, "g7g3": 1636, "g7g4": 1637, "g7g5": 1638, "g7g6": 1639, "g7g8": 1640, "g7g8n": 1641, "g7g8q": 1642, "g7g8r": 1643, "g7h5": 1644, "g7h6": 1645, "g7h7": 1646, "g7h8": 1647, "g8a2": 1648, "g8a8": 1649, "g8b3": 1650, "g8b8": 1651, "g8c4": 1652, "g8c8": 1653, "g8d5": 1654, "g8d8": 1655, "g8e6": 1656, "g8e7": 1657, "g8e8": 1658, "g8f6": 1659, "g8f7": 1660, "g8f8": 1661, "g8g1": 1662, "g8g2": 1663, "g8g3": 1664, "g8g4": 1665, "g8g5": 1666, "g8g6": 1667, "g8g7": 1668, "g8h6": 1669, "g8h7": 1670, "g8h8": 1671, "h1a1": 1672, "h1a8": 1673, "h1b1": 1674, "h1b7": 1675, "h1c1": 1676, "h1c6": 1677, "h1d1": 1678, "h1d5": 1679, "h1e1": 1680, "h1e4": 1681, "h1f1": 1682, "h1f2": 1683, "h1f3": 1684, "h1g1": 1685, "h1g2": 1686, "h1g3": 1687, "h1h2": 1688, "h1h3": 1689, "h1h4": 1690, "h1h5": 1691, "h1h6": 1692, "h1h7": 1693, "h1h8": 1694, "h2a2": 1695, "h2b2": 1696, "h2b8": 1697, "h2c2": 1698, "h2c7": 1699, "h2d2": 1700, "h2d6": 1701, "h2e2": 1702, "h2e5": 1703, "h2f1": 1704, "h2f2": 1705, "h2f3": 1706, "h2f4": 1707, "h2g1": 1708, "h2g1q": 1709, "h2g2": 1710, "h2g3": 1711, "h2g4": 1712, "h2h1": 1713, "h2h1q": 1714, "h2h1r": 1715, "h2h3": 1716, "h2h4": 1717, "h2h5": 1718, "h2h6": 1719, "h2h7": 1720, "h2h8": 1721, "h3a3": 1722, "h3b3": 1723, "h3c3": 1724, "h3c8": 1725, "h3d3": 1726, "h3d7": 1727, "h3e3": 1728, "h3e6": 1729, "h3f1": 1730, "h3f2": 1731, "h3f3": 1732, "h3f4": 1733, "h3f5": 1734, "h3g1": 1735, "h3g2": 1736, "h3g3": 1737, "h3g4": 1738, "h3g5": 1739, "h3h1": 1740, "h3h2": 1741, "h3h4": 1742, "h3h5": 1743, "h3h6": 1744, "h3h7": 1745, "h3h8": 1746, "h4a4": 1747, "h4b4": 1748, "h4c4": 1749, "h4d4": 1750, "h4d8": 1751, "h4e1": 1752, "h4e4": 1753, "h4e7": 1754, "h4f2": 1755, "h4f3": 1756, "h4f4": 1757, "h4f5": 1758, "h4f6": 1759, "h4g2": 1760, "h4g3": 1761, "h4g4": 1762, "h4g5": 1763, "h4g6": 1764, "h4h1": 1765, "h4h2": 1766, "h4h3": 1767, "h4h5": 1768, "h4h6": 1769, "h4h7": 1770, "h4h8": 1771, "h5a5": 1772, "h5b5": 1773, "h5c5": 1774, "h5d1": 1775, "h5d5": 1776, "h5e2": 1777, "h5e5": 1778, "h5e8": 1779, "h5f3": 1780, "h5f4": 1781, "h5f5": 1782, "h5f6": 1783, "h5f7": 1784, "h5g3": 1785, "h5g4": 1786, "h5g5": 1787, "h5g6": 1788, "h5g7": 1789, "h5h1": 1790, "h5h2": 1791, "h5h3": 1792, "h5h4": 1793, "h5h6": 1794, "h5h7": 1795, "h5h8": 1796, "h6a6": 1797, "h6b6": 1798, "h6c1": 1799, "h6c6": 1800, "h6d2": 1801, "h6d6": 1802, "h6e3": 1803, "h6e6": 1804, "h6f4": 1805, "h6f5": 1806, "h6f6": 1807, "h6f7": 1808, "h6f8": 1809, "h6g4": 1810, "h6g5": 1811, "h6g6": 1812, "h6g7": 1813, "h6g8": 1814, "h6h1": 1815, "h6h2": 1816, "h6h3": 1817, "h6h4": 1818, "h6h5": 1819, "h6h7": 1820, "h6h8": 1821, "h7a7": 1822, "h7b1": 1823, "h7b7": 1824, "h7c2": 1825, "h7c7": 1826, "h7d3": 1827, "h7d7": 1828, "h7e4": 1829, "h7e7": 1830, "h7f5": 1831, "h7f6": 1832, "h7f7": 1833, "h7f8": 1834, "h7g5": 1835, "h7g6": 1836, "h7g7": 1837, "h7g8": 1838, "h7g8q": 1839, "h7h1": 1840, "h7h2": 1841, "h7h3": 1842, "h7h4": 1843, "h7h5": 1844, "h7h6": 1845, "h7h8": 1846, "h7h8b": 1847, "h7h8n": 1848, "h7h8q": 1849, "h7h8r": 1850, "h8a1": 1851, "h8a8": 1852, "h8b2": 1853, "h8b8": 1854, "h8c3": 1855, "h8c8": 1856, "h8d4": 1857, "h8d8": 1858, "h8e5": 1859, "h8e8": 1860, "h8f6": 1861, "h8f7": 1862, "h8f8": 1863, "h8g6": 1864, "h8g7": 1865, "h8g8": 1866, "h8h1": 1867, "h8h2": 1868, "h8h3": 1869, "h8h4": 1870, "h8h5": 1871, "h8h6": 1872, "h8h7": 1873}